// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   VerStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell ver command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_VER_SHELL_VER              #language eng  "EFI Shell Version %d.%d\n"

#string STR_VER_SPEC_REVISION          #language eng  "EFI Specification Revision : %d.%d\n"

#string STR_VER_EFI_VENDOR             #language eng  "EFI Vendor                 : %s\n"

#string STR_VER_EFI_REVISION           #language eng  "EFI Revision               : %d.%d\n"

#string STR_VER_EFI_BUILD_REVISION     #language eng  "EFI Build Version          : %s\n"

#string STR_VER_SHELL_BUILD_REVISION   #language eng  "SHELL Build Version        : %s\n"

#string STR_VER_LINE_HELP              #language eng  "Displays the version information"

#string STR_VER_SHELL_SIG              #language eng  "EFI Shell Signature: %g\n"

#string STR_VER_VERBOSE_HELP           #language eng  "Displays the version information for this EFI Firmware.\n"
                                                      "\n"
                                                      "VER [-s]\n"
                                                      "\n"
                                                      "     -s     - Displays only the EFI Shell version\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the version information of a platform:\n"
                                                      "    fs0:\\> ver\n"
                                                      "    EFI Specification Revision : 1.10\n"
                                                      "    EFI Vendor                 : INTEL\n"
                                                      "    EFI Revision               : 14.5\n"
                                                      "\n"
                                                      "  * To display the version information of another platform:\n"
                                                      "    Note that the version information may vary from different platforms due to\n"
                                                      "    some platform-specific information.\n"
                                                      "    fs0:\\> ver\n"
                                                      "    EFI Specification Revision : 1.02\n"
                                                      "    EFI Vendor                 : INTEL\n"
                                                      "    EFI Revision               : 12.38\n"
                                                      "\n"
                                                      "    SAL Specification Revision      3. 0\n"
                                                      "      SAL_A Revision    = 1. 1\n"
                                                      "      SAL_B Revision    = 1. 1\n"
                                                      "\n"
                                                      "    PAL_A Revision        66.23\n"
                                                      "    PAL_B Revision        66.23\n"
                                                      "\n"
                                                      "    Other modules mentioned in FIT (Firmware Interface Table)\n"
                                                      "    FIT_Entry Type   0, Revision    2.60\n"
                                                      "    FIT_Entry Type  15, Revision    66.23\n"
                                                      "    FIT_Entry Type  16, Revision    0.90\n"
                                                      "    FIT_Entry Type  32, Revision    0.30\n"
                                                      "    FIT_Entry Type  30, Revision    1. 0\n"
                                                      "    FIT_Entry Type  17, Revision    0.90\n"
                                                      "    FIT_Entry Type  18, Revision    6. 0\n"
                                                      "    FIT_Entry Type  20, Revision    0.80\n"
                                                      "\n"
                                                      " SalProc Entry 000000003FE3F720 and GP 000000003FF22480\n"
                                                      " PalProc Entry 000000003FF48010 IO Port Base 00000FFFFC000000\n"
                                                      " Cache Enabled\n"
                                                      "\n"
                                                      "  * To display the version information of the EFI Shell:\n"
                                                      "    Shell> ver -s\n"
                                                      "    EFI Shell Version 1.0\n"


